app/controllers/home_controller.rb

  def index
    params[:datetime_from] = nil if params[:datetime_from].blank?
    params[:datetime_to] = nil if params[:datetime_to].blank?
    params[:datetime_from] ||= (Time.now - 24.hours).strftime(DATETIME_FORMAT)
    params[:datetime_to] ||= Time.now.strftime(DATETIME_FORMAT)
    datetime_from = Time.strptime(params[:datetime_from], DATETIME_FORMAT) + 7.hours
    datetime_to = Time.strptime(params[:datetime_to], DATETIME_FORMAT) + 7.hours
    @temperature_last = Temperature.order(:measure_time).last
    scope = Temperature.order(:measure_time)
---
SELECT  "temperatures".* FROM "temperatures"  ORDER BY "temperatures"."measure_time" DESC LIMIT 1
SELECT "temperatures".* FROM "temperatures" WHERE (( id % 2 ) = 0)  ORDER BY "temperatures"."measure_time" ASC